Autodesk.Revit.DB.Transaction.SetFailureHandlingOptions(Autodesk.Revit.DB.FailureHandlingOptions)
Sets options for handling failures to be used when the transaction is being committed or rolled back.
Remarks:
Options can be set at any time before the transaction is either committed or rolled back.
See Autodesk.Revit.DB.FailureHandlingOptions for details about available options.
Once committed or rolled back, the transaction object will reset its options to their default values.
options:
An instance of FailureHandlingOptions to be applied to the transaction
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Transaction.SetName(System.String)
Sets the transaction's name.
Remarks:
A transaction needs a name before it can be started, i.e. before one
of the 'Start' method is invoked for this transaction object.
The name will later appear in the Undo menu in Revit after a transaction
is successfully committed.
Another ways of setting the name is either during construction
or during the Autodesk.Revit.DB.Transaction.Start(System.String) method.
name:
A name for the transaction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name argument is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Transaction.RollBack(Autodesk.Revit.DB.FailureHandlingOptions)
Rolls back all changes made to the model during the transaction.
Remarks:
By rolling back a transaction, all changes made to the model are discarded.
RollBack may only be called for a transaction that has been started.
(Use the Autodesk.Revit.DB.Transaction.GetStatus method to check the current state.)
Be aware that rolling back may be delayed (as a result of failure handling.)
Callers should always check the returned status to test whether a transaction
was rolled back successfully. Only after rolling back is fully completed,
the transaction may be started again.
options:
A set of options
to be used for handling eventual failures during this call.
The options are only used temporarily during this rolling back process. After
the transaction is finished, the options will be reset to their default values.
Returns:
If finished successfully, this method returns TransactionStatus.RolledBack.
Be aware that the returned status does not have to be necessarily the same like
the status returned by Autodesk.Revit.DB.Transaction.GetStatus even when the method is called
immediately after rolling back the transaction. Such difference may happen due to actions
made by a transaction finalizer, if there was one set.
(See Autodesk.Revit.DB.FailureHandlingOptions for more details.)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current status of the transaction is not 'Started'.
Transaction must be started before calling Commit or Rollback.
-or-
The transaction's document is currently in failure mode.
No transaction operations are permitted until failure handling is finished.

Autodesk.Revit.DB.Transaction.Commit(Autodesk.Revit.DB.FailureHandlingOptions)
Commits all changes made to the model during the transaction.
options:
A set of options
to be used for handling eventual failures during this call.
The options are only used temporarily during the commitment process. After
the transaction is finished, the options will be reset to their default values.
Returns:
If finished successfully, this method returns TransactionStatus.Committed
Note it is possible the RolledBack status is returned instead as an outcome
of failure handling. If TransactionStatus.Pending is returned it means that
failure handling has not been finalized yet and Revit awaits user's actions.
Until committing is fully finalized, no changes to the document can be made
(including starting of new transactions).Be aware that the returned status does not have to be necessarily the same like
the status returned by Autodesk.Revit.DB.Transaction.GetStatus even when the method is called
immediately after committing the transaction. Such difference may happen due to actions
made by a transaction finalizer, if there was one set.
(See Autodesk.Revit.DB.FailureHandlingOptions for more details.)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current status of the transaction is not 'Started'.
Transaction must be started before calling Commit or Rollback.
-or-
The transaction's document is currently in failure mode.
No transaction operations are permitted until failure handling is finished.

Autodesk.Revit.DB.Transaction.Start(System.String)
Starts the transaction with an assigned name.
Remarks:
A transaction may be started only after it was instantiated or after it
was previously committed or rolled back.
Be aware that every time a transaction starts,
Failure Handling Options
will be reset to their default values. If a specific failure handling
is required, programmers need to use Autodesk.Revit.DB.Transaction.SetFailureHandlingOptions(Autodesk.Revit.DB.FailureHandlingOptions)
before the transaction is committed or rolled back.
name:
Name of the transaction; If the transaction already has name, this new one will preplace it.
The name will appear on the Undo menu in Revit if the transaction is successfully committed.
Returns:
If finished successfully, this method returns TransactionStatus.Started.
Note that unless starting is successful, changes cannot be made to the document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name argument is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Cannot modify the document for either a read-only external command is being executed, or changes to the document are temporarily disabled.
-or-
The transaction's document is currently in failure mode.
No transaction operations are permitted until failure handling is finished.
-or-
The transaction started already and has not been completed yet.
-or-
Starting a new transaction is not permitted. It could be because
another transaction already started and has not been completed yet,
or the document is in a state in which it cannot start a new transaction
(e.g. during failure handling or a read-only mode, which could be either permanent or temporary).

Autodesk.Revit.DB.Transaction.#ctor(Autodesk.Revit.DB.Document,System.String)
Instantiates a transaction object
Remarks:
The transaction does not start by creating a transaction object.
One of the 'Start' methods will need to be called  in order to start
this transaction.
document:
The document for which this transaction is going to be used.
name:
The name of the transaction. This name will appear in the undo menu
once the transaction is successfully committed. The name must not be empty.
The name can be reset later by either calling Autodesk.Revit.DB.Transaction.SetName(System.String) or
by using the name argument in the Autodesk.Revit.DB.Transaction.Start(System.String) method.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name argument is an empty string.
-or-
Document is a linked file. Transactions can only be used in primary documents (projects or families.)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Transaction.#ctor(Autodesk.Revit.DB.Document)
Instantiates a transaction object.
Remarks:
The transaction does not start by creating a transaction object.
One of the 'Start' methods will need to be called  in order to start
this transaction.
A transaction cannot start unless is has a valid (non-empty) name.
Because this constructor does not take a name, a name must be assigned later
before or during the 'Start' method.
document:
The document for which this transaction is going to be used.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Document is a linked file. Transactions can only be used in primary documents (projects or families.)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null